## PyMySQL - Membuat Tabel Baru di Database dan Memasukan Nilainya dari CSV File

Berikut ini cara membuat database dan user menggunakan pymysql.

Sumber : https://www.youtube.com/watch?v=WUVlllnJL60&list=PLyCwPGjh8kDyxSfwTkmTwsyK3m99ptxqF&index=6

In [1]:
#memasukan modul yang digunakan
import pymysql

In [2]:
#membuka data
f = open('students.csv', 'r')
fString = f.read()

In [3]:
#melihat isi fString, belum terlalu rapih
fString

'FIRST_NAME,LAST_NAME,AGE,GENDER,DEGREE\nHarold,Stephens,38,M,AA\nNicole,Robertson,22,F,AA\nRussell,Crawford,26,F,BS\nGeorge,Gonzales,28,F,AA\nJean,Wheeler,34,M,MA\nSharon,Cooper,37,M,BS\nChristina,Powell,26,M,BS\nKathy,Henry,39,M,AA\nEugene,Banks,28,F,MA\nEmily,Gonzalez,31,F,AA\nBrenda,Freeman,29,M,MA\nAlice,Marshall,36,F,BS\nBenjamin,Graham,36,F,BS\nDiane,Harris,30,M,MA\nMartin,Lewis,19,F,BS'

In [4]:
#melihat isi fString, sudah rapih line by line
print(fString)

FIRST_NAME,LAST_NAME,AGE,GENDER,DEGREE
Harold,Stephens,38,M,AA
Nicole,Robertson,22,F,AA
Russell,Crawford,26,F,BS
George,Gonzales,28,F,AA
Jean,Wheeler,34,M,MA
Sharon,Cooper,37,M,BS
Christina,Powell,26,M,BS
Kathy,Henry,39,M,AA
Eugene,Banks,28,F,MA
Emily,Gonzalez,31,F,AA
Brenda,Freeman,29,M,MA
Alice,Marshall,36,F,BS
Benjamin,Graham,36,F,BS
Diane,Harris,30,M,MA
Martin,Lewis,19,F,BS

In [5]:
#konversi string to list
fList = []

for line in fString.split('\n'):
    fList.append(line.split(','))

In [6]:
#melihat isi fList
fList

[['FIRST_NAME', 'LAST_NAME', 'AGE', 'GENDER', 'DEGREE'],
 ['Harold', 'Stephens', '38', 'M', 'AA'],
 ['Nicole', 'Robertson', '22', 'F', 'AA'],
 ['Russell', 'Crawford', '26', 'F', 'BS'],
 ['George', 'Gonzales', '28', 'F', 'AA'],
 ['Jean', 'Wheeler', '34', 'M', 'MA'],
 ['Sharon', 'Cooper', '37', 'M', 'BS'],
 ['Christina', 'Powell', '26', 'M', 'BS'],
 ['Kathy', 'Henry', '39', 'M', 'AA'],
 ['Eugene', 'Banks', '28', 'F', 'MA'],
 ['Emily', 'Gonzalez', '31', 'F', 'AA'],
 ['Brenda', 'Freeman', '29', 'M', 'MA'],
 ['Alice', 'Marshall', '36', 'F', 'BS'],
 ['Benjamin', 'Graham', '36', 'F', 'BS'],
 ['Diane', 'Harris', '30', 'M', 'MA'],
 ['Martin', 'Lewis', '19', 'F', 'BS']]

In [7]:
#membuka koneksi ke database
db = pymysql.connect('localhost', 'testuser', 'test123', 'TESTDB')

In [8]:
#mempersiapkan sebuah objek kursor dengan metode cursor()
cursor = db.cursor()

In [9]:
#menghilangkan tabel students jika sudah tersedia di database dengan metode execute()
cursor.execute('DROP TABLE IF EXISTS STUDENTS')

C:\Users\RASPIANI\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1051, "Unknown table 'testdb.students'")
  result = self._query(query)

0

In [10]:
#membuat nama kolom dari baris pertama dalam fList
FIRST_NAME = fList[0][0];
LAST_NAME = fList[0][1];
AGE = fList[0][2];
GENDER = fList[0][3];
DEGREE = fList[0][4]

In [11]:
#membuat tabel students // menempatkan sebuah koma setelah masing-masing kolom baru kecuali yang terakhir
queryCreateStudentsTable = """ CREATE TABLE STUDENTS(
                                {} varchar(255) not null, 
                                {} varchar(255) not null,
                                {} int,
                                {} char(1),
                                {} char(2))
                           """.format(FIRST_NAME, LAST_NAME, AGE, GENDER, DEGREE)

In [12]:
#mengeksekusi pembuatan tabel
cursor.execute(queryCreateStudentsTable)

0

In [13]:
#menghapus baris pertama dari fList dan menampilkannya
del fList[0]
print(fList)

[['Harold', 'Stephens', '38', 'M', 'AA'], ['Nicole', 'Robertson', '22', 'F', 'AA'], ['Russell', 'Crawford', '26', 'F', 'BS'], ['George', 'Gonzales', '28', 'F', 'AA'], ['Jean', 'Wheeler', '34', 'M', 'MA'], ['Sharon', 'Cooper', '37', 'M', 'BS'], ['Christina', 'Powell', '26', 'M', 'BS'], ['Kathy', 'Henry', '39', 'M', 'AA'], ['Eugene', 'Banks', '28', 'F', 'MA'], ['Emily', 'Gonzalez', '31', 'F', 'AA'], ['Brenda', 'Freeman', '29', 'M', 'MA'], ['Alice', 'Marshall', '36', 'F', 'BS'], ['Benjamin', 'Graham', '36', 'F', 'BS'], ['Diane', 'Harris', '30', 'M', 'MA'], ['Martin', 'Lewis', '19', 'F', 'BS']]

In [16]:
#mengenerate multiple nilai dari list untuk disimpan dalam sebuah query
#membuat tuple
rows = ''

for i in range(len(fList) - 1):
    rows += "('{}','{}','{}','{}','{}')".format(fList[i][0], fList[i][1], fList[i][2], fList[i][3], fList[i][4])
    if i != len(fList) - 2:
        rows += ','

In [17]:
#melihat isi dari rows
print(rows)

('Harold','Stephens','38','M','AA'),('Nicole','Robertson','22','F','AA'),('Russell','Crawford','26','F','BS'),('George','Gonzales','28','F','AA'),('Jean','Wheeler','34','M','MA'),('Sharon','Cooper','37','M','BS'),('Christina','Powell','26','M','BS'),('Kathy','Henry','39','M','AA'),('Eugene','Banks','28','F','MA'),('Emily','Gonzalez','31','F','AA'),('Brenda','Freeman','29','M','MA'),('Alice','Marshall','36','F','BS'),('Benjamin','Graham','36','F','BS'),('Diane','Harris','30','M','MA')

In [18]:
#mencetak rows // digunakan untuk meyakinkan nilai fList bukan sebuah koma
queryInsert = "INSERT INTO STUDENTS VALUES" + rows

In [19]:
#melihat hasil dari queryInsert
queryInsert

"INSERT INTO STUDENTS VALUES('Harold','Stephens','38','M','AA'),('Nicole','Robertson','22','F','AA'),('Russell','Crawford','26','F','BS'),('George','Gonzales','28','F','AA'),('Jean','Wheeler','34','M','MA'),('Sharon','Cooper','37','M','BS'),('Christina','Powell','26','M','BS'),('Kathy','Henry','39','M','AA'),('Eugene','Banks','28','F','MA'),('Emily','Gonzalez','31','F','AA'),('Brenda','Freeman','29','M','MA'),('Alice','Marshall','36','F','BS'),('Benjamin','Graham','36','F','BS'),('Diane','Harris','30','M','MA')"

In [20]:
# perintah mengeksekusi isi dari nilai yang di masukan ke database
try:
    cursor.execute(queryInsert)
    db.commit()
except:
    db.rollback()

In [21]:
#menutup database
db.close()

                    ##Semoga Bermanfaat
                    ##Raspiani_